---
kind: type
id: T:Autodesk.Revit.DB.Lighting.InitialColor
source: html/082ce770-10a9-7e3b-85f2-bde3c42a92c4.htm
---
# Autodesk.Revit.DB.Lighting.InitialColor

This class is the base class for calculating initial light color.

## Syntax (C#)
```csharp
public class InitialColor : IDisposable
```